In [1]:
!python -m pip install pandas

Collecting pandas
  Downloading https://files.pythonhosted.org/packages/61/c7/f943fceb712579bc538700e2c157dc4972e16abfe29bd4969149bad98c74/pandas-0.24.2-cp37-cp37m-win_amd64.whl (9.0MB)
Collecting pytz>=2011k (from pandas)
  Downloading https://files.pythonhosted.org/packages/3d/73/fe30c2daaaa0713420d0382b16fbb761409f532c56bdcc514bf7b6262bb6/pytz-2019.1-py2.py3-none-any.whl (510kB)
Collecting python-dateutil>=2.5.0 (from pandas)
  Using cached https://files.pythonhosted.org/packages/41/17/c62faccbfbd163c7f57f3844689e3a78bae1f403648a6afb1d0866d87fbb/python_dateutil-2.8.0-py2.py3-none-any.whl
Collecting numpy>=1.12.0 (from pandas)
  Using cached https://files.pythonhosted.org/packages/ce/61/be72eee50f042db3acf0b1fb86650ad36d6c0d9be9fc29f8505d3b9d6baa/numpy-1.16.4-cp37-cp37m-win_amd64.whl
Collecting six>=1.5 (from python-dateutil>=2.5.0->pandas)
  Using cached https://files.pythonhosted.org/packages/73/fb/00a976f728d0d1fecfe898238ce23f502a721c0ac0ecfedb80e0d88c64e9/six-1.12.0-py2.py3-none-any.whl
Installing collected packages: pytz, six, python-dateutil, numpy, pandas
Successfully installed numpy-1.16.4 pandas-0.24.2 python-dateutil-2.8.0 pytz-2019.1 six-1.12.0

In [1]:
import pandas
pandas.__version__

'0.24.2'

In [6]:
import pandas as pd 
data = ['2016','2017','2018','2019']
result = pd.Series(data)
print(result)

0    2016
1    2017
2    2018
3    2019
dtype: object

In [8]:
print(result)
result.index

0    2016
1    2017
2    2018
3    2019
dtype: object

In [11]:
result.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
result.values

array(['2016', '2017', '2018', '2019'], dtype=object)

In [12]:
#Series 객체의 이름을 지정하기

result.name='Year'
print(result)

0    2016
1    2017
2    2018
3    2019
Name: Year, dtype: object

In [13]:
result.index.name='No'
print(result)

No
0    2016
1    2017
2    2018
3    2019
Name: Year, dtype: object

In [18]:
print(result)
print(result[0])
print(result[3])

No
0    2016
1    2017
2    2018
3    2019
Name: Year, dtype: object
2016
2019

In [22]:
data = pd.Series([1,-1,3,5])
print(data+100)
print(data<100)

0    101
1     99
2    103
3    105
dtype: int64
0    True
1    True
2    True
3    True
dtype: bool

In [ ]:
#Series 와 각 컬럼의 이름이 주어질수잇당 
#컬럼에 접근하는 인댁스가 된당

In [26]:
#Data Frame 의 딕셔너리로 !! 

data = {'name':['Lee','kim','chio','Hwang'],
       'score':[100,95,90,85],
       'grade':['A','B','C','D']}
# print(data)

df = pd.DataFrame(data)

In [27]:
df   #dataframe 의 객체로 넣은 모습

    name  score grade
0    Lee    100     A
1    kim     95     B
2   chio     90     C
3  Hwang     85     D

In [28]:
df.index  # 0부터 4, step은 1 씩

RangeIndex(start=0, stop=4, step=1)

In [29]:
df.columns   #컬럼의 이름들도 다 인댁스다!!!!!중요!!!

Index(['name', 'score', 'grade'], dtype='object')

In [30]:
c = ['name','grade','score','etc']
df2 = pd.DataFrame(data,columns=c)

In [31]:
df2

    name grade  score  etc
0    Lee     A    100  NaN
1    kim     B     95  NaN
2   chio     C     90  NaN
3  Hwang     D     85  NaN

In [32]:
df2['name']

0      Lee
1      kim
2     chio
3    Hwang
Name: name, dtype: object

In [34]:
df2['grade']

0    A
1    B
2    C
3    D
Name: grade, dtype: object

In [37]:
df2['etc']=[11,12,33,44]
df2

    name grade  score  etc
0    Lee     A    100   11
1    kim     B     95   12
2   chio     C     90   33
3  Hwang     D     85   44

In [36]:
df2

    name grade  score  etc
0    Lee     A    100   11
1    kim     B     95   12
2   chio     C     90   33
3  Hwang     D     85   44

In [47]:
import numpy as np
df2['etc']=np.random.randn(4)

In [48]:
df2

    name grade  score       etc
0    Lee     A    100 -0.532592
1    kim     B     95  1.191815
2   chio     C     90 -0.869905
3  Hwang     D     85 -0.055608

In [49]:
import numpy as np
df2['etc']=np.zeros(4)

In [50]:
df2

    name grade  score  etc
0    Lee     A    100  0.0
1    kim     B     95  0.0
2   chio     C     90  0.0
3  Hwang     D     85  0.0